---
type: IDuctPressureDropServer
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 3
tags: [revit-api, class]
---

# IDuctPressureDropServer

`Autodesk.Revit.DB.Mechanical.IDuctPressureDropServer` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Calculate | 2014 | `void Calculate ( DuctPressureDropData data )` |
| Method | GetHtmlDescription | 2014 | `string GetHtmlDescription ()` |
| Method | GetInformationLink | 2014 | `string GetInformationLink ()` |